{
    "modelTopology": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential_3",
        "layers": [
          {
            "class_name": "LSTM",
            "config": {
              "units": 52,
              "activation": "relu",
              "recurrent_activation": "hard_sigmoid",
              "use_bias": true,
              "batch_input_shape": [null, 10, 26],
              "dtype": "float32"
            }
          },
          {
            "class_name": "TimeDistributed",
            "config": {
              "layer": {
                "class_name": "Dense",
                "config": {
                  "units": 26,
                  "activation": "softmax",
                  "use_bias": true,
                  "name": "dense_Dense3",
                  "trainable": true
                }
              }
            }
          }
        ]
      }
    },
    "keras_version": "tfjs-layers 2.0.0",
    "format": "layers-model",
    "generatedBy": "TensorFlow.js tfjs-layers v2.0.0",
    "weightsManifest": [
      {
        "paths": ["./autocorrect_model.weights.bin"],
        "weights": [
          {
            "name": "lstm_LSTM3/kernel",
            "shape": [26, 208],
            "dtype": "float32"
          },
          {
            "name": "lstm_LSTM3/recurrent_kernel",
            "shape": [52, 208],
            "dtype": "float32"
          },
          {
            "name": "lstm_LSTM3/bias",
            "shape": [208],
            "dtype": "float32"
          },
          {
            "name": "time_distributed_TimeDistributed3/kernel",
            "shape": [52, 26],
            "dtype": "float32"
          },
          {
            "name": "time_distributed_TimeDistributed3/bias",
            "shape": [26],
            "dtype": "float32"
          }
        ]
      }
    ]
  }
  